app/Http/Controllers/Admin/UserController.php

select * from `users` where `status` != 3 and (`full_name` like '%%' or `email` like '%%' or `phone` like '%%') and `users`.`deleted_at` is null order by `created_at` desc limit 25 offset 0
select count(*) as aggregate from `users` where `status` != 3 and (`full_name` like '%%' or `email` like '%%' or `phone` like '%%') and `users`.`deleted_at` is null
---
    public function getUsers(Request $request)
    {
        // query filter, search

        $query = User::where("status", "!=", 3); // just get user when status 1,2
        $search = $request->search ? $request->search : "";
        $take = (int) $request->take;

        // search email, phone ,name
        $query = $query->where(function ($query) use ($search) {
            $query->where("full_name", "like", "%" . $search . "%")
                ->orWhere("email", "like", "%" . $search . "%")
                ->orWhere("phone", "like", "%" . $search . "%");
        });

        //return data
        $result = $query->orderBy("created_at", "desc")->paginate($take);